In [2]:
import pandas as pd

 ### Creating panda's Series from Python list

In [3]:
contries=['IND','CHN','USA','RUS']
index=[0,1,2,3]

In [4]:
my_series1=pd.Series(contries,index)

In [5]:
print(my_series1)

0    IND
1    CHN
2    USA
3    RUS
dtype: object

In [6]:
type(my_series1)

pandas.core.series.Series

- Here Index axis is optional

### Creating panda's Series from Python Dictionary

In [7]:
my_dictionary={'name':'Manoj','gender':'male','ocupation':'Engineer'}

In [8]:
my_series2=pd.Series(my_dictionary)
print(my_series2)

gender           male
name            Manoj
ocupation    Engineer
dtype: object

### Grabbing information from Series

In [9]:
my_series1[0]

'IND'

In [10]:
my_series2['name']

'Manoj'

In [11]:
my_series1[1]

'CHN'

In [12]:
my_series3=pd.Series([1,2,3,4],['Manoj','Male','Engineer','MZn'])

In [13]:
my_series3['Manoj']

1

### Performing Arithmetic operations on Series

In [14]:
Series1=pd.Series([1,2,3,4],['Manoj','Male','Engineer','MZn'])

In [15]:
Series2=pd.Series([1,2,3,4],['Kumar','Male','Engineer','Delhi'])

In [16]:
Series1-Series2 #NaN -Not a number

Delhi       NaN
Engineer    0.0
Kumar       NaN
MZn         NaN
Male        0.0
Manoj       NaN
dtype: float64

In [17]:
Series1+Series2

Delhi       NaN
Engineer    6.0
Kumar       NaN
MZn         NaN
Male        4.0
Manoj       NaN
dtype: float64

In [18]:
Series1*Series2

Delhi       NaN
Engineer    9.0
Kumar       NaN
MZn         NaN
Male        4.0
Manoj       NaN
dtype: float64

In [19]:
Series1/Series2

Delhi       NaN
Engineer    1.0
Kumar       NaN
MZn         NaN
Male        1.0
Manoj       NaN
dtype: float64

### DataFrames

In [20]:
# Basic Syntax to creating Data frame:
#pd.DataFrame(data,index)

In [21]:
# Data Frame of Random Number having 5 Rows and 4 column:
import numpy as np
df=pd.DataFrame(np.random.random((5,4)),['A','B','C','D','E'],['W','X','Y','Z'])

In [22]:
df

          W         X         Y         Z
A  0.917695  0.154589  0.219247  0.993510
B  0.793982  0.304772  0.595526  0.881655
C  0.702129  0.938852  0.349156  0.686905
D  0.672685  0.126428  0.162654  0.419575
E  0.192553  0.287231  0.468631  0.833321

#here each column is a panda series which is sharing a same index means DF is a collection of Series sharing the same Index.

#### Creating DataFrame from a dictionary Of Series.

In [23]:
my_dict={'Name':pd.Series(['AA','BB','CC','DD'],index=[0,1,2,3]),
         'Age': pd.Series([15,20,25,30],index=[0,1,2,3]),
        'Gender':pd.Series(['M','F','F','M'],index=[0,1,2,3])}

In [24]:
pd.DataFrame(my_dict)

   Age Gender Name
0   15      M   AA
1   20      F   BB
2   25      F   CC
3   30      M   DD

#### Creating DataFrame from a dictionary Of list.

In [25]:
my_dict1={'Name':['Manoj','SAN','JAM','OPO'],
    'Age':[20,25,30,35],
    'Year':[2012,2013,2014,2015] 
   }

In [26]:
my_df1=pd.DataFrame(my_dict1,index=[0,1,2,3])

In [27]:
my_df1

   Age   Name  Year
0   20  Manoj  2012
1   25    SAN  2013
2   30    JAM  2014
3   35    OPO  2015

In [28]:
my_df1= pd.DataFrame(my_dict1,index=[0,1,2,3])
my_df1

   Age   Name  Year
0   20  Manoj  2012
1   25    SAN  2013
2   30    JAM  2014
3   35    OPO  2015

### Selecting Columns from DataFrames

In [29]:
my_df1['Age'] # As We choose a column having same index so output is a series

0    20
1    25
2    30
3    35
Name: Age, dtype: int64

In [30]:
type(my_df1['Age'])

pandas.core.series.Series

### If we grab multiple columns, the result will be a DataFrame:

In [31]:
    my_df1[['Name','Year']]

    Name  Year
0  Manoj  2012
1    SAN  2013
2    JAM  2014
3    OPO  2015

In [32]:
pd.DataFrame(my_dict1)

   Age   Name  Year
0   20  Manoj  2012
1   25    SAN  2013
2   30    JAM  2014
3   35    OPO  2015

In [33]:
my_dict1['Nationality']=pd.Series(['IND','USA','CHN','JPN'],index=[0,1,2,3])

In [34]:
my_df2=pd.DataFrame(my_dict1)
print(my_df2)
my_df2

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
2   30    JAM         CHN  2014
3   35    OPO         JPN  2015

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
2   30    JAM         CHN  2014
3   35    OPO         JPN  2015

#### Removing rows/columns from a DataFrame

In [35]:
my_df2.drop('Year',axis=1) # TO delete the column

   Age   Name Nationality
0   20  Manoj         IND
1   25    SAN         USA
2   30    JAM         CHN
3   35    OPO         JPN

In [36]:
# To delete the ith Index row

In [37]:
my_df2.drop(2,axis=0)

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
3   35    OPO         JPN  2015

In [38]:
my_df2 # means drop function not deleting permanently

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
2   30    JAM         CHN  2014
3   35    OPO         JPN  2015

In [39]:
# As pandas does not delete permanently to avoid accidently loose the data, To Delete permanently we have to use 
# inplace=True

In [40]:
my_df2.drop(2,axis=0,inplace=True)

In [41]:
print(my_df2)

   Age   Name Nationality  Year
0   20  Manoj         IND  2012
1   25    SAN         USA  2013
3   35    OPO         JPN  2015

#### Selecting Rows in a DataFrame

In [42]:
my_df2.loc[0] # label Name means at my_df2.loc[2] will throw an error

Age               20
Name           Manoj
Nationality      IND
Year            2012
Name: 0, dtype: object

In [43]:
my_df2.iloc[2] # my_df2.loc[3] will throw an errro will work as by index

Age              35
Name            OPO
Nationality     JPN
Year           2015
Name: 3, dtype: object

In [44]:
#### Select the subset of rows and Column

In [45]:
my_df2.loc[0,'Name']

'Manoj'

In [46]:
my_df2.loc[0,'Age']

20

In [47]:
my_df2.loc[[0,1],['Name','Age']]

    Name  Age
0  Manoj   20
1    SAN   25

In [48]:
# Continue from Conditional selection using []

In [49]:
df3=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [50]:
df3

          W         X         Y         Z
A  0.270288  0.954027  0.161049  2.209906
B -0.106933 -0.033048  1.411119  1.345090
C -1.861978  1.926945 -0.702219  1.704421
D  1.544395  0.068177 -1.761547 -3.912600
E -0.289226  0.704049  0.321967  0.792732

In [51]:
# We need a data fram where W>0
df3[df3['W']>0]

          W         X         Y         Z
A  0.270288  0.954027  0.161049  2.209906
D  1.544395  0.068177 -1.761547 -3.912600

In [52]:
# Return values from x Only 
df3[df3['W']>0]['X']

A    0.954027
D    0.068177
Name: X, dtype: float64

In [53]:
df3[df3['W']>0][['X','Y']]

          X         Y
A  0.954027  0.161049
D  0.068177 -1.761547

#### Resetting the Index of a DataFrame

In [54]:
df3

          W         X         Y         Z
A  0.270288  0.954027  0.161049  2.209906
B -0.106933 -0.033048  1.411119  1.345090
C -1.861978  1.926945 -0.702219  1.704421
D  1.544395  0.068177 -1.761547 -3.912600
E -0.289226  0.704049  0.321967  0.792732

In [55]:
df3.reset_index()

  index         W         X         Y         Z
0     A  0.270288  0.954027  0.161049  2.209906
1     B -0.106933 -0.033048  1.411119  1.345090
2     C -1.861978  1.926945 -0.702219  1.704421
3     D  1.544395  0.068177 -1.761547 -3.912600
4     E -0.289226  0.704049  0.321967  0.792732

In [56]:
#df3.reset_index(inplace=True)

In [57]:
df3

          W         X         Y         Z
A  0.270288  0.954027  0.161049  2.209906
B -0.106933 -0.033048  1.411119  1.345090
C -1.861978  1.926945 -0.702219  1.704421
D  1.544395  0.068177 -1.761547 -3.912600
E -0.289226  0.704049  0.321967  0.792732

#### Setting the Index of a DataFrame

In [58]:
df3['ID']=['ID1','ID2','ID3','ID4','ID5']

In [59]:
df3

          W         X         Y         Z   ID
A  0.270288  0.954027  0.161049  2.209906  ID1
B -0.106933 -0.033048  1.411119  1.345090  ID2
C -1.861978  1.926945 -0.702219  1.704421  ID3
D  1.544395  0.068177 -1.761547 -3.912600  ID4
E -0.289226  0.704049  0.321967  0.792732  ID5

In [60]:
df3.set_index('ID')

            W         X         Y         Z
ID
ID1  0.270288  0.954027  0.161049  2.209906
ID2 -0.106933 -0.033048  1.411119  1.345090
ID3 -1.861978  1.926945 -0.702219  1.704421
ID4  1.544395  0.068177 -1.761547 -3.912600
ID5 -0.289226  0.704049  0.321967  0.792732

#### MultiIndex from a tuple:

In [61]:
outside=['0-level','0-level','0-level','1-level','1-level','1-level']
inside=[21,22,23,21,22,23]
my_index=list(zip(outside,inside)) # Combined a list of tuples

In [62]:
my_index

[('0-level', 21),
 ('0-level', 22),
 ('0-level', 23),
 ('1-level', 21),
 ('1-level', 22),
 ('1-level', 23)]

#### using Multiindex.from_tuples(my_index)

In [63]:
my_index=pd.MultiIndex.from_tuples(my_index)

In [64]:
my_index

MultiIndex(levels=[['0-level', '1-level'], [21, 22, 23]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [65]:
df=pd.DataFrame(np.random.randn(6,2),index=my_index,columns=['A','B'])

In [66]:
df

                   A         B
0-level 21 -1.406198 -0.623142
        22 -1.342123 -0.896577
        23  0.510078  0.303671
1-level 21  1.459437 -0.362371
        22 -0.264478 -0.836777
        23 -0.547689  1.116981

#### Missing Data

In [67]:
dt={'A':[1,np.nan,3],'B':[2,np.nan,np.nan],'C':[4,5,6]}

In [68]:
dt

{'A': [1, nan, 3], 'B': [2, nan, nan], 'C': [4, 5, 6]}

In [69]:
df=pd.DataFrame(dt)

In [70]:
df

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

In [71]:
df.dropna()

     A    B  C
0  1.0  2.0  4

In [72]:
df

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

In [73]:
df.dropna(axis=1)

   C
0  4
1  5
2  6

In [74]:
df.fillna('100')

     A    B  C
0    1    2  4
1  100  100  5
2    3  100  6

In [75]:
df.fillna('100',axis=1)# To make permanent we can use inplace=True

     A    B  C
0    1    2  4
1  100  100  5
2    3  100  6

#### groupby

In [84]:
dict={'Company':['Google','Google','Microsoft','Microsoft','Adobe','Intuit','Intuit'],
      'Persons':['Ram','Shyam','Jitu','Mitu','Pitu','Situ','Nitu'],
      'Sales':[200,100,300,175,266,185,586]}

In [86]:
df_g=pd.DataFrame(dict)

In [87]:
df_g

     Company Persons  Sales
0     Google     Ram    200
1     Google   Shyam    100
2  Microsoft    Jitu    300
3  Microsoft    Mitu    175
4      Adobe    Pitu    266
5     Intuit    Situ    185
6     Intuit    Nitu    586

In [88]:
df_g.groupby('Company').mean()

           Sales
Company
Adobe      266.0
Google     150.0
Intuit     385.5
Microsoft  237.5

#### count-> number of times an Item occur

In [89]:
df_g.groupby('Company').count() # We are checking each company how many times occur

           Persons  Sales
Company
Adobe            1      1
Google           2      2
Intuit           2      2
Microsoft        2      2

In [95]:
df_g.groupby('Persons').count()

         Company  Sales
Persons
Jitu           1      1
Mitu           1      1
Nitu           1      1
Pitu           1      1
Ram            1      1
Shyam          1      1
Situ           1      1